.planning/case_profiles/case_028_v3_apu_bay_ventilation_dicts/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object omega; }

// case_028 v3 (V65-A B78) ventilation · specific dissipation
// omega = sqrt(k) / (C_mu^0.25 · L) = sqrt(0.000338) / (0.09^0.25 · 0.3) ≈ 0.1124 1/s
// (k=0.000338 from U_in=0.3 m/s · L=0.3 m turbulence length scale ≈ 0.07 × intake_duct hydraulic diameter)

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 0.1124;

boundaryField
{
    intake_duct
    {
        type            fixedValue;
        value           uniform 0.1124;
    }
    vent_door
    {
        type            inletOutlet;
        inletValue      uniform 0.1124;
        value           uniform 0.1124;
    }
    end_minus_x { type omegaWallFunction; value uniform 0.1124; }
    end_plus_x  { type omegaWallFunction; value uniform 0.1124; }
    bay_top     { type omegaWallFunction; value uniform 0.1124; }
    bay_bottom  { type omegaWallFunction; value uniform 0.1124; }
    bay_side_p  { type omegaWallFunction; value uniform 0.1124; }
    bay_side_n  { type omegaWallFunction; value uniform 0.1124; }
    "(Outer_Surf|Inner_Surf|Plane_Outer_Surf|door|plenum|exhaust_pipe_1|exhaust_section|bleed_air_pipe|ejector|gearbox_.*|compressor|load_compressor|load_volute|combustion_chamber|fuel_valve|firewall_.*|Frame_.*|beam_.*)"
    {
        type            omegaWallFunction;
        value           uniform 0.1124;
    }
}
